<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"3f59fe6cc9e6f5d6d9f08084edd0598f4dc62f8fea58bdee93ccfb1c4b7b93b6","plan_job_ref":"Job CICD for Splitrr Infra #61 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10678327525","plan_out_hash":"c8a0ea2c9e861f7d04ed84321f21e3071a74470b6536eb8679813cf5f771c293","plan_hash":"a96fa02e96047a8cc32eed9c61b73582f666764262ee36be0368181ee7519c98","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.cloudfront.data.aws_iam_policy_document.origin will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "origin" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::spiltrr-dev-bucket/*",
            ]
+           sid       = "1"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::949263681218:distribution/E2Y1XQZVO267IC",
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.cloudfront.aws_cloudfront_distribution.s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "E2Y1XQZVO267IC"
        tags                            = {
            "Name" = "Cloud Front"
        }
#        (22 unchanged attributes hidden)

!~      default_cache_behavior {
#            (16 unchanged attributes hidden)

+           forwarded_values {
+               headers                 = (known after apply)
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward           = "none"
+                   whitelisted_names = (known after apply)
                }
            }
        }

#        (3 unchanged blocks hidden)
    }

  # module.cloudfront.aws_s3_bucket_policy.origin will be updated in-place
!~  resource "aws_s3_bucket_policy" "origin" {
        id     = "spiltrr-dev-bucket"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "s3:GetObject"
-                       Condition = {
-                           StringEquals = {
-                               "AWS:SourceArn" = "arn:aws:cloudfront::949263681218:distribution/E2Y1XQZVO267IC"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = "arn:aws:s3:::spiltrr-dev-bucket/*"
-                       Sid       = "1"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # module.ecs-ec2.aws_autoscaling_group.app_asg will be updated in-place
!~  resource "aws_autoscaling_group" "app_asg" {
!~      desired_capacity                 = 2 -> 1
        id                               = "terraform-20240901164336886700000002"
        name                             = "terraform-20240901164336886700000002"
#        (30 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #61](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10678327525)